000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/УслугиБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УслугиБанка</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МгновеннаяРассрочка</name>
      <description>Мгновенная рассрочка</description>
    </items>
  </predefined>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <comment>Услуга заблокирована</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <comment>Банковский идентификатор кредитования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСкидкиНаценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияБанка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПредоставления</name>
    <comment>Период, например, рассрочки платежа - в платежах (например 6 платежей)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>EnumRef.ТипыУслугБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>Эквайрер</name>
    <comment>Эквайрер по умолчанию</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураИсключения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПредоставления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыФормированияСегментов</name>
  <enumValues>
    <name>ФормироватьДинамически</name>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
  </enumValues>
  <enumValues>
    <name>ФормироватьВручную</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыУслугБанка/ТипыУслугБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУслугБанка</name>
  <enumValues>
    <name>ОплатаЧастями</name>
  </enumValues>
  <enumValues>
    <name>МгновеннаяРассрочка</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
  <enumValues>
    <name>ПакетМалыша</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.Предопределенный И НЕ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда

		ТолькоПросмотр = Истина;

	КонецЕсли;

	Если НЕ ПустаяСтрока(ИмяТекущейСтраницы) Тогда

		Попытка

			Элементы.Страницы.ТекущаяСтраница = Элементы[ИмяТекущейСтраницы];

		Исключение	КонецПопытки;

	КонецЕсли;

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	ИмяТекущейСтраницы = Элементы.Страницы.ТекущаяСтраница.Имя;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьОформлениеЭлементов();

	Оповестить("УслугаБанкаИзменение",, Объект.Ссылка);

КонецПроцедуры

&НаСервере	//	LNK 13.11.2020 06:34:57
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)


КонецПроцедуры

#КонецОбласти

//	---------------------------------------------------------------------------------------

&НаКлиенте
Процедура ТипУслугиПриИзменении(Элемент)

	Если ПустаяСтрока(Объект.Наименование) Тогда

		Объект.Наименование = СокрЛП(Объект.ТипУслуги);

	КонецЕсли;

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСкидкиНаценкиПриИзменении(Элемент)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура БлокированПриИзменении(Элемент)

	ОбщегоНазначенияКлиент.УстановитьТолькоПросмотрДляФормы(Элементы, Команды, Объект.Блокирован, "ТипУслуги, Блокирован");

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредоставленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если НЕ ТекущиеДанные = Неопределено И Поле = Элементы.НоменклатураПредоставленияКнопкаExcel Тогда

		СтандартнаяОбработка = Ложь;
		ВыборКомандыЗагрузкиСегментаНоменклатуры(ТекущиеДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИсключенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элемент.ТекущиеДанные;

	Если НЕ ТекущиеДанные = Неопределено И  Поле = Элементы.НоменклатураИсключенияКнопкаExcel Тогда

		СтандартнаяОбработка = Ложь;
		ВыборКомандыЗагрузкиСегментаНоменклатуры(ТекущиеДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, Значение, ДанныеВыбора, СтандартнаяОбработка)

	Если НЕ Значение = Неопределено Тогда

		СтандартнаяОбработка = Ложь;

		ОтборПоСпособу = Новый СписокЗначений;
		ОтборПоСпособу.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"), ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьВручную"));
		ОтборПоСпособу.Добавить(ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьДинамически"), ПредопределенноеЗначение("Перечисление.СпособыФормированияСегментов.ФормироватьДинамически"));

		ПараметрыФормыВыбора = Новый Структура;
		ПараметрыФормыВыбора.Вставить("ТекущийЭлемент"    , Значение);
		ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна" , РежимОткрытияОкнаФормы.Независимый);
		ПараметрыФормыВыбора.Вставить("РежимВыбора"       , Истина);
		ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
		ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормыВыбора.Вставить("Отбор"             , Новый Структура("СпособФормирования, ПометкаУдаления", ОтборПоСпособу, Ложь));

		ОткрытьФорму("Справочник." + ?(ТипЗнч(Значение) = Тип("СправочникСсылка.СегментыНоменклатуры"), "СегментыНоменклатуры", "Номенклатура") + ".ФормаВыбора", ПараметрыФормыВыбора, Элемент);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредоставленияНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	НоменклатураНачалоВыбора(Элемент, Элементы.НоменклатураПредоставления.ТекущиеДанные.Номенклатура, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИсключенияНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	НоменклатураНачалоВыбора(Элемент, Элементы.НоменклатураИсключения.ТекущиеДанные.Номенклатура, ДанныеВыбора, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредоставленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока И НЕ Копирование И НЕ Элемент.ТекущиеДанные = Неопределено Тогда

		Элемент.ТекущиеДанные.Номенклатура = ПредопределенноеЗначение("Справочник.СегментыНоменклатуры.ПустаяСсылка");
		НазначитьКолонкеИндексКартинки(Элемент.ТекущиеДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИсключенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСтрока И НЕ Копирование И НЕ Элемент.ТекущиеДанные = Неопределено Тогда

		Элемент.ТекущиеДанные.Номенклатура = ПредопределенноеЗначение("Справочник.СегментыНоменклатуры.ПустаяСсылка");
		НазначитьКолонкеИндексКартинки(Элемент.ТекущиеДанные);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредоставленияНоменклатураПриИзменении(Элемент)

	НазначитьКолонкеИндексКартинки(Элементы.НоменклатураПредоставления.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИсключенияНоменклатураПриИзменении(Элемент)

	НазначитьКолонкеИндексКартинки(Элементы.НоменклатураИсключения.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПредоставленияНоменклатураОчистка(Элемент, СтандартнаяОбработка)

	НазначитьКолонкеИндексКартинки(Элементы.НоменклатураПредоставления.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураИсключенияНоменклатураОчистка(Элемент, СтандартнаяОбработка)

	НазначитьКолонкеИндексКартинки(Элементы.НоменклатураИсключения.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура НазначитьКолонкеИндексКартинки(ТекущиеДанные)

	Если НЕ ТекущиеДанные = Неопределено Тогда

		ТекущиеДанные.КнопкаExcel = ?(ЗначениеЗаполнено(ТекущиеДанные.Номенклатура), ?(ТипЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.СегментыНоменклатуры"), 8, 16), 0);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеЭлементов()

	ОбщегоНазначенияКлиент.УстановитьТолькоПросмотрДляФормы(Элементы, Команды, Объект.Блокирован, "ТипУслуги, Блокирован");

	МгновеннаяРассрочка = (Объект.ТипУслуги = ПредопределенноеЗначение("Перечисление.ТипыУслугБанка.МгновеннаяРассрочка"));
	ПакетМалыша = (Объект.ТипУслуги = ПредопределенноеЗначение("Перечисление.ТипыУслугБанка.ПакетМалыша"));

	Элементы.Страницы.Видимость = НЕ МгновеннаяРассрочка;
	Элементы.Блокирован.Видимость = НЕ МгновеннаяРассрочка;
	Элементы.ПериодПредоставления.Видимость = НЕ (МгновеннаяРассрочка ИЛИ ПакетМалыша);
	Элементы.Эквайрер.Видимость = НЕ МгновеннаяРассрочка;

	Элементы.ИспользоватьСкидкиНаценки.ШрифтЗаголовка = Новый Шрифт(,, Объект.ИспользоватьСкидкиНаценки);

	Если НЕ МгновеннаяРассрочка Тогда

		Для каждого ТекущиеДанные Из Объект.НоменклатураПредоставления Цикл

			НазначитьКолонкеИндексКартинки(ТекущиеДанные);

		КонецЦикла;

		Для каждого ТекущиеДанные Из Объект.НоменклатураИсключения Цикл

			НазначитьКолонкеИндексКартинки(ТекущиеДанные);

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#Область ПроцедурыЗагрузкиСоставаСегментаИзТаблицыExcel

&НаКлиенте
Процедура ВыборКомандыЗагрузкиСегментаНоменклатуры(ТекущиеДанные)

	СегментНоменклатуры = ТекущиеДанные.Номенклатура;

	Если ЗначениеЗаполнено(СегментНоменклатуры) И ТипЗнч(СегментНоменклатуры) = Тип("СправочникСсылка.СегментыНоменклатуры") Тогда

		ДополнительныеПараметры = Новый Структура(
			"СегментНоменклатуры, ФайлВыбран", СегментНоменклатуры, Ложь);

		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ВыборКомандыЗагрузкиСегментаНоменклатурыЗавершение", ЭтотОбъект, ДополнительныеПараметры);

		ПоказатьВопрос(ОписаниеОповещения
		, "Сегмент «" + СегментНоменклатуры + "» будет загружен из указанного Вами файла.
		  |Текущий состав сегмента перед загрузкой очищается!
		  |Подтвердите своё решение:", РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.ОК
		, "Загрузка сегмента из таблицы «Excel»", КодВозвратаДиалога.Отмена);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыборКомандыЗагрузкиСегментаНоменклатурыЗавершение(КодВозврата, ДополнительныеПараметры)	Экспорт

	Если НЕ КодВозврата = КодВозвратаДиалога.ОК Тогда

		Возврат;

	КонецЕсли;

	Если ДополнительныеПараметры.ФайлВыбран = Ложь Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ДиалогВыбораФайлаExcelЗавершение", ЭтотОбъект, ДополнительныеПараметры);

		ДиалогВыбораФайла  = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Заголовок = "Выберите файл книги Excel";
		ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Лист Excel'") + " (*.xls)|*.xls|" + НСтр("ru = 'Лист Excel2007'") + " (*.xlsx)|*.xlsx";
		ДиалогВыбораФайла.ПолноеИмяФайла = ПолноеИмяИмпортируемогоФайла;
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;

		ДиалогВыбораФайла.Показать(ОписаниеОповещения);

	ИначеЕсли ДополнительныеПараметры.ФайлВыбран = Истина Тогда

		ФайлЗагрузки = Новый Файл(ДополнительныеПараметры.ПолноеИмяИмпортируемогоФайла);

		Если НЕ ФайлЗагрузки.Существует() Тогда

			ПоказатьОповещениеПользователя("Загрузка невозможна",, "Указанный файл не обнаружен - укажите существующий файл!", БиблиотекаКартинок.Вопрос32);

		Иначе

			ПолноеИмяИмпортируемогоФайла = ДополнительныеПараметры.ПолноеИмяИмпортируемогоФайла;	//	запомним на следующую загрузку

			ПоказатьОповещениеПользователя("Загрузка данных из файла ...",, "Выполняется загрузка «" + ПолноеИмяИмпортируемогоФайла + "»", БиблиотекаКартинок.Предупреждение32);

			АдресВХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяИмпортируемогоФайла), УникальныйИдентификатор);
			ЗагрузитьСоставСегментаИзТаблицыExcel(ДополнительныеПараметры.СегментНоменклатуры, АдресВХранилище, ФайлЗагрузки.Расширение);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаExcelЗавершение(СписокФайлов, ДополнительныеПараметры)	Экспорт

	Если ТипЗнч(СписокФайлов) = Тип("Массив") И НЕ СписокФайлов.Количество() = 0 Тогда

		ДополнительныеПараметры.ФайлВыбран = Истина;
		ДополнительныеПараметры.Вставить("ПолноеИмяИмпортируемогоФайла", СписокФайлов[0]);

		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ВыборКомандыЗагрузкиСегментаНоменклатурыЗавершение", ЭтотОбъект, ДополнительныеПараметры);

		ПоказатьВопрос(ОписаниеОповещения
		, "Ещё раз нужно подтвердить - сегмент «" + ДополнительныеПараметры.СегментНоменклатуры + "» будет загружен из файла
		  |«" + ДополнительныеПараметры.ПолноеИмяИмпортируемогоФайла + "».
		  |ТЕКУЩИЙ СОСТАВ СЕГМЕНТА ПЕРЕД ЗАГРУЗКОЙ ОЧИЩАЕТСЯ!
		  |Подтвердите своё решение:", РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.ОК
		, "Загрузка сегмента из таблицы «Excel»", КодВозвратаДиалога.Отмена);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСоставСегментаИзТаблицыExcel(СегментНоменклатуры, АдресВХранилище, РасширениеИмени)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаСправочник
	|ГДЕ
	|	ТаблицаСправочник.Ссылка В(&СписокТоваров)
	|	И НЕ ТаблицаСправочник.ЭтоГруппа"
	);
	Запрос.УстановитьПараметр("СписокТоваров", ЗаполнениеОбъектов.ЗагрузитьДанныеВМассивИзТаблицыExcel(АдресВХранилище, РасширениеИмени, Истина));
	
	СегментыСервер.СформироватьНоменклатуруСегмента(СегментНоменклатуры,, Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти
